In [141]:
import pandas as pd

In [142]:
#Load Data
cpi = pd.read_csv('.\Data\ConsumerPrice Index1960-2023.csv')
unemp = pd.read_csv('./Data/UnemploymentUK1855-2016.csv')
interest = pd.read_csv('./Data/Interest Rates-Long Term Bond Yields1960-2023.csv')

In [143]:
print(cpi.head())
print(unemp.head())
print(interest.head())

         DATE  CPALTT01GBM659N
0  1960-01-01        -0.452899
1  1960-02-01        -0.362647
2  1960-03-01        -0.543971
3  1960-04-01         0.730594
4  1960-05-01         1.099908
         DATE  AURUKM
0  1855-01-01    3.42
1  1855-02-01    4.04
2  1855-03-01    4.20
3  1855-04-01    4.14
4  1855-05-01    3.64
         DATE  IRLTLT01GBM156N
0  1960-01-01             5.33
1  1960-02-01             5.40
2  1960-03-01             5.59
3  1960-04-01             5.67
4  1960-05-01             5.69

In [144]:
print(cpi.shape)
print(unemp.shape)
print(interest.shape)

(760, 2)
(1944, 2)
(761, 2)

In [145]:
start_date = pd.to_datetime('01-01-1990')
end_date = pd.to_datetime('12-01-2010')

In [146]:
unemp['DATE'] = pd.to_datetime(unemp['DATE'])
cpi['DATE'] = pd.to_datetime(cpi['DATE'])
interest['DATE']=pd.to_datetime(interest['DATE'])

In [147]:
unemp

           DATE  AURUKM
0    1855-01-01    3.42
1    1855-02-01    4.04
2    1855-03-01    4.20
3    1855-04-01    4.14
4    1855-05-01    3.64
...         ...     ...
1939 2016-08-01    4.80
1940 2016-09-01    4.80
1941 2016-10-01    4.80
1942 2016-11-01    4.80
1943 2016-12-01    4.70

[1944 rows x 2 columns]

In [148]:
unemp = unemp[(unemp['DATE'] >= start_date) & (unemp['DATE'] <= end_date)]
cpi = cpi[(cpi['DATE']>=start_date)&(cpi['DATE']<=end_date)]
interest = interest[(interest['DATE']>=start_date)&(interest['DATE']<=end_date)]

In [149]:
# Reset the indexes of the DataFrames
cpi_reset = cpi.reset_index(drop=True)
unemp_reset = unemp.reset_index(drop=True)

In [150]:
concatenated_df = pd.concat([cpi_reset[['DATE', 'CPALTT01GBM659N']], unemp_reset['AURUKM']], axis=1)

In [151]:
concatenated_df

          DATE  CPALTT01GBM659N  AURUKM
0   1990-01-01              5.9     6.9
1   1990-02-01              6.3     6.9
2   1990-03-01              6.2     6.9
3   1990-04-01              7.7     6.9
4   1990-05-01              8.2     6.9
..         ...              ...     ...
247 2010-08-01              2.4     7.8
248 2010-09-01              2.4     7.9
249 2010-10-01              2.5     7.9
250 2010-11-01              2.6     7.9
251 2010-12-01              3.1     7.9

[252 rows x 3 columns]